[Killed] BlockStatement
src/calculator.js:2:51
 class Calculator {
-    static main(month1, day1, month2, day2, year) {
-        if (month1 < 1 || month1 > 12) {
-            throw new Error("invalid month1");
-        }
-        if (month2 < 1 || month2 > 12) {
-            throw new Error("invalid month2");
-        }
-        if (day1 < 1 || day1 > 31) {
-            throw new Error("invalid day1");
-        }
-        if (day2 < 1 || day2 > 31) {
-            throw new Error("invalid day2");
-        }
-        if (year < 1 || year > 10000) {
-            throw new Error("invalid year");
-        }
-        if (month1 === month2 && day1 > day2) {
-            throw new Error("day1 must be less than day2 if month1 is equal to month2");
-        }
-        if (month1 > month2) {
-            throw new Error("month1 must be less than month2");
-        }
-
-        return this.#calculate(month1, day1, month2, day2, year);
-    }
+    static main(month1, day1, month2, day2, year) {}
 
     static #calculate(month1, day1, month2, day2, year) {
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] EqualityOperator
src/calculator.js:3:13
 class Calculator {
     static main(month1, day1, month2, day2, year) {
-        if (month1 < 1 || month1 > 12) {
+        if (month1 >= 1 || month1 > 12) {
             throw new Error("invalid month1");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:3:27
 class Calculator {
     static main(month1, day1, month2, day2, year) {
-        if (month1 < 1 || month1 > 12) {
+        if (month1 < 1 || false) {
             throw new Error("invalid month1");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] EqualityOperator
src/calculator.js:6:13
         if (month1 < 1 || month1 > 12) {
             throw new Error("invalid month1");
         }
-        if (month2 < 1 || month2 > 12) {
+        if (month2 >= 1 || month2 > 12) {
             throw new Error("invalid month2");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:6:13
         if (month1 < 1 || month1 > 12) {
             throw new Error("invalid month1");
         }
-        if (month2 < 1 || month2 > 12) {
+        if (false) {
             throw new Error("invalid month2");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent
ok 1 - Test MyClass's addStudent

[Killed] LogicalOperator
src/calculator.js:9:13
         if (month2 < 1 || month2 > 12) {
             throw new Error("invalid month2");
         }
-        if (day1 < 1 || day1 > 31) {
+        if (day1 < 1 && day1 > 31) {
             throw new Error("invalid day1");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] EqualityOperator
src/calculator.js:9:13
         if (month2 < 1 || month2 > 12) {
             throw new Error("invalid month2");
         }
-        if (day1 < 1 || day1 > 31) {
+        if (day1 >= 1 || day1 > 31) {
             throw new Error("invalid day1");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] StringLiteral
src/calculator.js:10:29
             throw new Error("invalid month2");
         }
         if (day1 < 1 || day1 > 31) {
-            throw new Error("invalid day1");
+            throw new Error("");
         }
         if (day2 < 1 || day2 > 31) {
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] EqualityOperator
src/calculator.js:12:25
         if (day1 < 1 || day1 > 31) {
             throw new Error("invalid day1");
         }
-        if (day2 < 1 || day2 > 31) {
+        if (day2 < 1 || day2 <= 31) {
             throw new Error("invalid day2");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent
ok 1 - Test MyClass's addStudent

[Killed] BlockStatement
src/calculator.js:12:36
         if (day1 < 1 || day1 > 31) {
             throw new Error("invalid day1");
         }
-        if (day2 < 1 || day2 > 31) {
-            throw new Error("invalid day2");
-        }
+        if (day2 < 1 || day2 > 31) {}
         if (year < 1 || year > 10000) {
             throw new Error("invalid year");
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:15:13
         if (day2 < 1 || day2 > 31) {
             throw new Error("invalid day2");
         }
-        if (year < 1 || year > 10000) {
+        if (false) {
             throw new Error("invalid year");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:15:13
         if (day2 < 1 || day2 > 31) {
             throw new Error("invalid day2");
         }
-        if (year < 1 || year > 10000) {
+        if (false || year > 10000) {
             throw new Error("invalid year");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] EqualityOperator
src/calculator.js:18:13
         if (year < 1 || year > 10000) {
             throw new Error("invalid year");
         }
-        if (month1 === month2 && day1 > day2) {
+        if (month1 !== month2 && day1 > day2) {
             throw new Error("day1 must be less than day2 if month1 is equal to month2");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:18:34
         if (year < 1 || year > 10000) {
             throw new Error("invalid year");
         }
-        if (month1 === month2 && day1 > day2) {
+        if (month1 === month2 && true) {
             throw new Error("day1 must be less than day2 if month1 is equal to month2");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:21:13
         if (month1 === month2 && day1 > day2) {
             throw new Error("day1 must be less than day2 if month1 is equal to month2");
         }
-        if (month1 > month2) {
+        if (false) {
             throw new Error("month1 must be less than month2");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] EqualityOperator
src/calculator.js:21:13
         if (month1 === month2 && day1 > day2) {
             throw new Error("day1 must be less than day2 if month1 is equal to month2");
         }
-        if (month1 > month2) {
+        if (month1 <= month2) {
             throw new Error("month1 must be less than month2");
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent
ok 1 - Test MyClass's addStudent

[Killed] StringLiteral
src/calculator.js:22:29
             throw new Error("day1 must be less than day2 if month1 is equal to month2");
         }
         if (month1 > month2) {
-            throw new Error("month1 must be less than month2");
+            throw new Error("");
         }
 
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent
ok 1 - Test MyClass's addStudent

[Killed] BlockStatement
src/calculator.js:28:57
         return this.#calculate(month1, day1, month2, day2, year);
     }
 
-    static #calculate(month1, day1, month2, day2, year) {
-        let numDays;
-
-        if (month2 === month1) {
-            numDays = day2 - day1;
-        } else {
-            // ignore 0 index
-            let daysIn = [0, 31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
-            if (this.#isLeapYear(year))
-                daysIn[2] = 29;
-            else
-                daysIn[2] = 28;
-
-            numDays = day2 + (daysIn[month1] - day1);
-
-            for (let i = month1 + 1; i <= month2 - 1; i++)
-                numDays += daysIn[i];
-        }
-        return numDays;
-    }
+    static #calculate(month1, day1, month2, day2, year) {}
 
     static #isLeapYear(year) {
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] EqualityOperator
src/calculator.js:31:13
     static #calculate(month1, day1, month2, day2, year) {
         let numDays;
 
-        if (month2 === month1) {
+        if (month2 !== month1) {
             numDays = day2 - day1;
         } else {
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:31:13
     static #calculate(month1, day1, month2, day2, year) {
         let numDays;
 
-        if (month2 === month1) {
+        if (true) {
             numDays = day2 - day1;
         } else {
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ArithmeticOperator
src/calculator.js:32:23
         let numDays;
 
         if (month2 === month1) {
-            numDays = day2 - day1;
+            numDays = day2 + day1;
         } else {
             // ignore 0 index
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] BlockStatement
src/calculator.js:33:16
 
         if (month2 === month1) {
             numDays = day2 - day1;
-        } else {
-            // ignore 0 index
-            let daysIn = [0, 31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
-            if (this.#isLeapYear(year))
-                daysIn[2] = 29;
-            else
-                daysIn[2] = 28;
-
-            numDays = day2 + (daysIn[month1] - day1);
-
-            for (let i = month1 + 1; i <= month2 - 1; i++)
-                numDays += daysIn[i];
-        }
+        } else {}
         return numDays;
     }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:36:17
         } else {
             // ignore 0 index
             let daysIn = [0, 31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
-            if (this.#isLeapYear(year))
+            if (true)
                 daysIn[2] = 29;
             else
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:36:17
         } else {
             // ignore 0 index
             let daysIn = [0, 31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
-            if (this.#isLeapYear(year))
+            if (false)
                 daysIn[2] = 29;
             else
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent
ok 1 - Test MyClass's addStudent

[Killed] ArithmeticOperator
src/calculator.js:41:31
             else
                 daysIn[2] = 28;
 
-            numDays = day2 + (daysIn[month1] - day1);
+            numDays = day2 + (daysIn[month1] + day1);
 
             for (let i = month1 + 1; i <= month2 - 1; i++)
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ArithmeticOperator
src/calculator.js:41:23
             else
                 daysIn[2] = 28;
 
-            numDays = day2 + (daysIn[month1] - day1);
+            numDays = day2 - (daysIn[month1] - day1);
 
             for (let i = month1 + 1; i <= month2 - 1; i++)
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent
ok 1 - Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:43:38
 
             numDays = day2 + (daysIn[month1] - day1);
 
-            for (let i = month1 + 1; i <= month2 - 1; i++)
+            for (let i = month1 + 1; false; i++)
                 numDays += daysIn[i];
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ArithmeticOperator
src/calculator.js:43:43
 
             numDays = day2 + (daysIn[month1] - day1);
 
-            for (let i = month1 + 1; i <= month2 - 1; i++)
+            for (let i = month1 + 1; i <= month2 + 1; i++)
                 numDays += daysIn[i];
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] AssignmentOperator
src/calculator.js:44:17
             numDays = day2 + (daysIn[month1] - day1);
 
             for (let i = month1 + 1; i <= month2 - 1; i++)
-                numDays += daysIn[i];
+                numDays -= daysIn[i];
         }
         return numDays;
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] BlockStatement
src/calculator.js:49:30
         return numDays;
     }
 
-    static #isLeapYear(year) {
-        return ((year % 4 === 0) && (year % 100 !== 0)) || (year % 400 === 0);
-    }
+    static #isLeapYear(year) {}
 }
 
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ArithmeticOperator
src/calculator.js:50:38
     }
 
     static #isLeapYear(year) {
-        return ((year % 4 === 0) && (year % 100 !== 0)) || (year % 400 === 0);
+        return ((year % 4 === 0) && (year * 100 !== 0)) || (year % 400 === 0);
     }
 }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:50:18
     }
 
     static #isLeapYear(year) {
-        return ((year % 4 === 0) && (year % 100 !== 0)) || (year % 400 === 0);
+        return ((true) && (year % 100 !== 0)) || (year % 400 === 0);
     }
 }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent
